# 1. Берем официальный готовый образ с установленным Python
FROM python:3.11-slim

# 2. Создаем внутри контейнера рабочую папку для нашего кода
WORKDIR /app

# 3. Копируем файл со списком библиотек внутрь контейнера
COPY requirements.txt .

# 4. Устанавливаем зависимости прямо в контейнер (виртуальное окружение тут НЕ нужно!)
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем оставшийся код нашего приложения в контейнер
COPY . .

# 6. Указываем команду, которая автоматически запустится при старте контейнера
CMD ["python", "app.py"]
